Table of Contents
 Class CombiInputSIA
Namespace
IdeaRS.OpenModel.Loading
Assembly
IdeaRS.OpenModel.dll
Combination according to SIA in the model
[OpenModelClass("CI.StructModel.Loading.CombiInputEC,CI.Loading", "CI.StructModel.Loading.ICombiInput,CI.BasicTypes", typeof(CombiInput))]
public class CombiInputSIA : CombiInput
Inheritance
object
OpenObject
OpenElementId
CombiInput
CombiInputSIA
Inherited Members
 CombiInput.Name
 CombiInput.Items
 CombiInput.Description
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 CombiInputSIA()
Constructor
public CombiInputSIA()
Properties
 TypeCalculationCombi
Type of combination
[OpenModelProperty("TypeLinear_Envelope")]
public TypeCalculationCombiSIA TypeCalculationCombi { get; set; }
Property Value
TypeCalculationCombiSIA
 TypeCombiSIA
Type of EC combination
[OpenModelProperty("TypeCombiEC")]
public TypeOfCombiSIA TypeCombiSIA { get; set; }
Property Value
TypeOfCombiSIA
 Edit this page